# proxy_list = [
#     "192.168.1.1:8080",
#     "203.0.113.5:3128",
#     "198.51.100.12:8080"
#     # Добавьте сюда ваши прокси
# ]

proxy_list = [
    "192.168.1.1:8080",
    "203.0.113.5:3128",
    "198.51.100.12:8080",
    "203.0.113.10:8080",
    "198.51.100.14:3128",
    "203.0.113.15:8080",
    "198.51.100.18:3128",
    "203.0.113.20:8080",
    "198.51.100.22:3128",
    "203.0.113.25:8080",
    "198.51.100.28:3128",
    "203.0.113.30:8080",
    "198.51.100.32:3128",
    "203.0.113.35:8080",
    "198.51.100.36:3128",
    "203.0.113.40:8080",
    "198.51.100.42:3128",
    "203.0.113.45:8080",
    "198.51.100.48:3128",
    "203.0.113.50:8080",
    "198.51.100.52:3128",
    "203.0.113.55:8080",
    "198.51.100.56:3128",
    "203.0.113.60:8080",
    "198.51.100.62:3128",
    "203.0.113.65:8080",
    "198.51.100.68:3128",
    "203.0.113.70:8080",
    "198.51.100.72:3128"
]

def createOption(i, options):
    proxy = proxy_list[i % len(proxy_list)]
    options.set_preference("network.proxy.type", 1)
    options.set_preference("network.proxy.http", proxy.split(":")[0])
    options.set_preference("network.proxy.http_port", int(proxy.split(":")[1]))
    options.set_preference("network.proxy.ssl", proxy.split(":")[0])
    options.set_preference("network.proxy.ssl_port", int(proxy.split(":")[1]))
    return options

